Hi @evgeniy-ivlev-archie ,

Sorry for the late reply. Do you still have issues with this?
For me your example perfectly works

```hcl
resource "argocd_repository" "echo-server-repo" {
  name     = "my-private-repo"
  type     = "git"
  repo     = "https://github.com/mkilchhofer/argocd-terraform-support-private.git"
  username = "it-doesnt-matter"
  password = var.gh_token
}

```

And here a TF apply run:

```bash
$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # argocd_repository.echo-server-repo will be created
  + resource "argocd_repository" "echo-server-repo" {
      + connection_state_status = (known after apply)
      + id                      = (known after apply)
      + inherited_creds         = (known after apply)
      + name                    = "my-private-repo"
      + password                = (sensitive value)
      + repo                    = "https://github.com/mkilchhofer/argocd-terraform-support-private.git"
      + type                    = "git"
      + username                = "it-doesnt-matter"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

argocd_repository.echo-server-repo: Creating...
argocd_repository.echo-server-repo: Creation complete after 3s [id=https://github.com/mkilchhofer/argocd-terraform-support-private.git]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Repo then appears in Argo CD:

<img width="1429" alt="Image" src="https://github.com/user-attachments/assets/a971c84f-ae20-4681-8f96-0c6c885bca07" />